# Ultralytics YOLO , AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 45  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]             路 640  640  3
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2      路 320  320  64
  - [-1, 1, EnhancementModel, [ 64 ] ]  # 1    the PGFE module
  - [-1, 1, C2f, [64, True]]   # 2            路 160  160  128

  - [-1, 1, Conv, [128, 3, 2]]  # 3-P2/4      路 160  160  128
  - [-1, 1, C2f, [128, True]]   # 4           路 160  160  128

  - [-1, 1, Conv, [256, 3, 2]]  # 5-P3/8      路  80  80  256
  - [-1, 1, C2f, [256, True]]   # 6           路  80  80  256

  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16     路  40  40  512
  - [-1, 1, C2f, [512, True]]   # 8           路  40  40  512

  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32     路  20  20  512
  - [-1, 1, C2f, [1024, True]]  # 10          路  20  20  512
  - [-1, 1, SPPF, [1024, 5]]    # 11          路  20  20  512

# YOLOv8.0-P2 head
head:
  - [[4, 6, 8, 11], 1, CSSA_1, [128]]  # 12  the HRFM-SOD module

  - [[12], 1, Detect, [nc]] # Detect
